---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData
source: html/f1233bf2-ec6a-67a6-50d0-b7ae1382c64e.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData

The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryConnectorData : IDisposable
```

## Remarks
width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,